#!/bin/zsh
# SPDX-FileCopyrightText: 2023 mattmc3
# SPDX-FileCopyrightText: 2024 Samuel Wu
#
# SPDX-License-Identifier: MIT

# Completions
mattmc3/zephyr path:plugins/completion
zsh-users/zsh-completions kind:fpath path:src
aloxaf/fzf-tab
# Freed-Wu/fzf-tab-source

# Better defaults
mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/utility

# Prompt
romkatv/powerlevel10k kind:fpath

# Utilties
romkatv/zsh-bench kind:path

# Other Fish-like features
hlissner/zsh-autopair
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
